'''
Створити функцію main(), в якій створити верховну раду і описати наступне консольне меню:
      Введіть 1, щоб додати фракцію
      Введіть 2, щоб видалити фракцію
      Введіть 3, щоб очистити фракцію
      Введіть 4, щоб вивести фракції
      Введіть 5, щоб видалити фракцію
      Введіть 6, щоб додати депутата у фракцію
      Введіть 7, щоб видалити депутата із фракції
      Введіть 8, щоб вивести список хабарників у фракції
      Введіть 9, щоб вивести список  хабарників у раді
      Введіть 10, щоб вивести найбільшого хабарника у раді
      Введіть 11, щоб вивести найбільшого хабарника у фракції.
      Введіть 12, щоб перевірити чи є дупутат у фракції
      Введіть 13, щоб перевірити чи є депутат у раді
      Введіть 14, щоб дати хабаря депутату.
      Введіть 0, щоб вийти із програми.
'''
from models import Deputat


def main():
    d1 = Deputat(weight=60, height=180, last_name='Lytsenko', first_name='Yrii', bribe_taker=True)
    d2 = Deputat(70, 175, 'Login', 'Vitali', True)
    d3 = Deputat(80, 179, 'Poroshenko', 'Oleksii')
    deputats = {d1, d2, d3}
    for e in deputats:
        e.give_tribute()
        print(e)
    d1.give_tribute()
    print(d1)
    d2.give_tribute()
    print(d2)
    d2.give_tribute()
    print(d2)
    d3.give_tribute()
    print(d3)


if __name__ == '__main__':
    main()
